# YOLOv3 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 72  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [17,146, 36,83, 22,173]  # P3/8
  - [24,169, 24,169, 24,169]  # P4/16
  - [26,169, 37,121, 31,173]  # P5/32

# darknet53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, nn.MaxPool2d, [2, 2]], # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],  
   [-1, 1, nn.MaxPool2d, [2, 2]], # 3-P2/4
   [-1, 1, Conv, [128, 3, 1]],  
   [-1, 1, Conv, [64, 1, 1]],  
   [-1, 1, Conv, [128, 3, 1]],  
   [-1, 1, nn.MaxPool2d, [2, 2]], # 7-P3/8
   [-1, 1, Conv, [256, 3, 1]],  
   [-1, 1, Conv, [128, 1, 1]],  
   [-1, 1, Conv, [256, 3, 1]],  
   [-1, 1, nn.MaxPool2d, [2, 2]], # 11-P3/16
   [-1, 1, Conv, [512, 3, 1]],  
   [-1, 1, Conv, [256, 1, 1]],  
   [-1, 1, Conv, [512, 3, 1]],  
   [-1, 1, Conv, [256, 1, 1]],  
   [-1, 1, Conv, [512, 3, 1]],  
   [-1, 1, nn.MaxPool2d, [2, 2]], # 17-P3/32
   [-1, 1, Conv, [1024, 3, 1]],  
   [-1, 1, Conv, [512, 1, 1]],  
   [-1, 1, Conv, [1024, 3, 1]],  
   [-1, 1, Conv, [512, 1, 1]],  
   [-1, 1, Conv, [1024, 3, 1]] # 22
  ]

# YOLOv3 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [1024, 3, 1]], # 26 (P5/32-large)

   [-2, 1, Conv, [256, 3, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 16], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [512, 3, 1]],  # 33 (P4/16-medium)

   [-2, 1, Conv, [128, 3, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 10], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],  # 40 (P3/8-small)

   [[40, 33, 26], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
